In [1]:
import pandas as pd

In [3]:
items = {'Bob' : pd.Series(data = [245, 25, 55], index = ['bike', 'pants', 'watch']),
         'Alice' : pd.Series(data = [40, 110, 500, 45], index = ['book', 'glasses', 'bike', 'pants'])}
print(type(items))
print(items)

<class 'dict'>
{'Bob': bike     245
pants     25
watch     55
dtype: int64, 'Alice': book        40
glasses    110
bike       500
pants       45
dtype: int64}

In [4]:
shopping_cart = pd.DataFrame(items)
shopping_cart

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

In [5]:
shopping_cart.values
shopping_cart.size
shopping_cart.columns
shopping_cart.index

Index(['bike', 'book', 'glasses', 'pants', 'watch'], dtype='object')

In [6]:
data = {'Bob' : pd.Series([245, 25, 55]),
        'Alice' : pd.Series([40, 110, 500, 45])}
df = pd.DataFrame(data)
df

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

In [7]:
df.shape
df.ndim
df.values

array([[245.,  40.],
       [ 25., 110.],
       [ 55., 500.],
       [ nan,  45.]])

In [8]:
df = pd.DataFrame(data,index=['label1','label2','label3','label4'])
df

        Bob  Alice
label1  NaN    NaN
label2  NaN    NaN
label3  NaN    NaN
label4  NaN    NaN

In [69]:
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35}, 
          {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5}]

# We create a DataFrame 
store_items = pd.DataFrame(items2)

# We display the DataFrame
store_items

   bikes  pants  watches  glasses
0     20     30       35      NaN
1     15      5       10     50.0

In [70]:
store_items = pd.DataFrame(items2,index=['store1','store2'])
store_items

        bikes  pants  watches  glasses
store1     20     30       35      NaN
store2     15      5       10     50.0

In [71]:
print(store_items[['bikes']])
print(store_items[['bikes','pants']])
print(store_items.loc[['store1']])
print(store_items['bikes']['store2'])

        bikes
store1     20
store2     15
        bikes  pants
store1     20     30
store2     15      5
        bikes  pants  watches  glasses
store1     20     30       35      NaN
15

In [72]:
store_items['shirts'] = [15, 2]
store_items

        bikes  pants  watches  glasses  shirts
store1     20     30       35      NaN      15
store2     15      5       10     50.0       2

In [73]:
store_items['suits'] = store_items['shirts'] + store_items['pants']
store_items

        bikes  pants  watches  glasses  shirts  suits
store1     20     30       35      NaN      15     45
store2     15      5       10     50.0       2      7

In [74]:
new_items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]
new_store = pd.DataFrame(new_items,index = ['store3'])
new_store

        bikes  pants  watches  glasses
store3     20     30       35        4

In [40]:
#store_items = store_items.append(new_store)

In [75]:
store_items['new_watches'] = store_items['watches'][1:]
store_items

        bikes  pants  watches  glasses  shirts  suits  new_watches
store1     20     30       35      NaN      15     45          NaN
store2     15      5       10     50.0       2      7         10.0

In [76]:
#store_items.insert(4,'shoe',[10,2,0])
store_items.insert(4, 'shoes', [8,5])
store_items

        bikes  pants  watches  glasses  shoes  shirts  suits  new_watches
store1     20     30       35      NaN      8      15     45          NaN
store2     15      5       10     50.0      5       2      7         10.0

In [77]:
store_items.pop('new_watches')
store_items

        bikes  pants  watches  glasses  shoes  shirts  suits
store1     20     30       35      NaN      8      15     45
store2     15      5       10     50.0      5       2      7

In [80]:
store_items.drop(['watches','shoes'],axis=1)
store_items

        bikes  pants  watches  glasses  shoes  shirts  suits
store1     20     30       35      NaN      8      15     45
store2     15      5       10     50.0      5       2      7

In [82]:
store_items = store_items.drop(['store2', 'store1'], axis = 0)

# we display the modified DataFrame
store_items

Empty DataFrame
Columns: [bikes, pants, watches, glasses, shoes, shirts, suits]
Index: []

In [83]:
store_items = store_items.rename(columns = {'bikes': 'hats'})

# we display the modified DataFrame
store_items

Empty DataFrame
Columns: [hats, pants, watches, glasses, shoes, shirts, suits]
Index: []

In [84]:
store_items = store_items.set_index('pants')

# we display the modified DataFrame
store_items

Empty DataFrame
Columns: [hats, watches, glasses, shoes, shirts, suits]
Index: []

In [2]:
# We create a list of Python dictionaries
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35, 'shirts': 15, 'shoes':8, 'suits':45},
{'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5, 'shirts': 2, 'shoes':5, 'suits':7},
{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes':10}]

# We create a DataFrame  and provide the row index
store_items = pd.DataFrame(items2, index = ['store 1', 'store 2', 'store 3'])

# We display the DataFrame
store_items

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

In [6]:
x = store_items.isnull().sum().sum()
print(x)

3

In [7]:
store_items.count()

bikes      3
pants      3
watches    3
shirts     2
shoes      3
suits      2
glasses    2
dtype: int64

In [8]:
store_items.dropna(axis=0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 2     15      5       10     2.0      5    7.0     50.0

In [9]:
store_items.dropna(axis=1)

         bikes  pants  watches  shoes
store 1     20     30       35      8
store 2     15      5       10      5
store 3     20     30       35     10

In [10]:
store_items.fillna(0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      0.0
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     0.0     10    0.0      4.0

In [11]:
store_items.fillna(method='ffill',axis=0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     2.0     10    7.0      4.0

In [13]:
store_items.fillna(method='ffill',axis = 1)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0    15.0    8.0   45.0     45.0
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0
store 3   20.0   30.0     35.0    35.0   10.0   10.0      4.0

In [14]:
store_items.fillna(method='backfill',axis=0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0     50.0
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

In [15]:
store_items.fillna(method='backfill',axis=1)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0    15.0    8.0   45.0      NaN
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0
store 3   20.0   30.0     35.0    10.0   10.0    4.0      4.0

In [16]:
store_items.interpolate(method='linear',axis=0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     2.0     10    7.0      4.0

In [17]:
store_items.interpolate(methods='linear',axis=1)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0    15.0    8.0   45.0     45.0
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0
store 3   20.0   30.0     35.0    22.5   10.0    7.0      4.0